/*
PART 02 리눅스 운영 및 관리 -----------------------------------------------------------------
Chapter 01 파일 시스템 관련 명령어
section 01 권환 및 그룹 설정
umask 
일반 파일 권한 664 –rw- rw- r-	touch로 만들시
디렉터리 권한 775 –rwx rwx rw- mkdir로 만들시

/etc/fstab 
dump 명령으로 통한 백업시 사용주기를 1.매일 데이터 백업가능 2. 이틀에 한번 데이터 백업 가능

-----------------------------------------------------------------------------------------

section 02 파일 시스템의 관리

mkfs , mke2fs 
-t : 생성할 파일 시스템 타입(ext2, ext3, ext4)을 지정

fdisk
새로운 파티션의 생성(n), 삭제(d), 타입결정(t)(속성지정)

du
디렉터리 별로 디스크 사용량 확인

df
파티션 단위로 사용량 확인
---------------------------------------------------------------------------------------
Chapter 02 셸(Shell)

chsh
가능한 셸의 목록을 확인하는 명령
-------------------------------------------------------------------------------------
Chapter 03 프로세스 관리
section 02 프로세스 유틸리티
jobs
작업이 중지된 상태
백그라운드로 진행중인 상태

nice
< : 우선순위가 인위적으로 높아진 상태

bg
포그라운드 -> 백그라운드 전환
일시정지(suspend)키 : Ctrl + z

fg
백그라운드 -> 포그라운드 전환
종료 : Ctrl + c
------------------------------------------------------------------------------------

Chapter 04 에디터
section 02 에디터 활용

emacs
파일 저장 : Crtl+x,Crtl+s
종료 	  : Crtl+x,Crtl+c
------------------------------------------------------------------------------------

Chapter 05 소프트웨어 설치 및 삭제
section 01 프로그램 설치

rpm --nodeps
의존성 관계를 무시하고 설치

rpm --force
기존에 설치된 패키지와 관계없이 강제로 설치
------------------------------------------------------------------------------------
section 02 소스 파일 설치

아카이브(tar)
다수 개의 파일이나 디렉터리를 하나의 파일로 묶는 것.

t : 파일 목록 나열
v : 명령 실할 때 대상이 되고 있는 파일 보여줌
p : 파일의 권한 그대로 유지(생성 되었을 때)
x : tar로 묶은 파일을 원본 파일로 해제

Chapter 06 장치 설정 
section 01 주변 장치 연결 및 설정

LPRng, CUPS
515포트, 631포트
------------------------------------------------------------------------------------
PART 03 리눅스 활용------------------------------------------------
Chapter 01 X-Window
section 01 개념 및 사용법 

환경변수 DISPLAY
X클라이언트 프로그램을 원격지의 X서버에 전달하기 위해 수정하는 환경변수
------------------------------------------------------------------------------------
section 02 X-윈도우 활용 

구분
KDE
GNOME

이미지 뷰어
Gwenview
gThumb, eog

텍스트 편집기
kwrite


사운드 및 비디오

Totem

카메라 동영상 프로그램

CHEESE


Dolphin
Konqueror(컹거러)


이미지 편집 프로그램

GIMP



xauth
MMC 방식의 인증방식을 사용하기 위한 필수 유틸리티
X 서버에 접근할 수 있는 클라이언트 서버에 생성된 키 기반으로 제어할 때
Xauthority 파일의 쿠기 내용을 추가,삭제,리스트 출력 하는 유틸리티


xhost
호스트 기반 인증 방식을 사용하기 위한 필요한 유틸리티
클라이언트를 +(지정) -(해제)한다.


KDE
Qt : 라이브러리, QT툴 킷을 기반으로 한다.
------------------------------------------------------------------------------------


































*/